// (显示有问题，请参照课后习题4.10)企业发放的奖金根据利润提成。利润I低于或等于100000元的，奖金可提成10%；利润高于100000元，低于200000元时，低于100000元的部分按10%提成，高于100000元的部分，可提成7.5%；2000001000000元的部分按1%提成。从键盘输入当月利润I，求应发奖金总数。
// 输入160000，输出示例：
// 请输入利润i:
// 奖金是:14500.00

#include <stdio.h>

int main()
{
    int i;
    float bonus = 0;
    printf("请输入利润i:");
    scanf("%d", &i);
    if (i <= 100000) bonus = i*0.1;
    else if (i <= 200000) bonus = 100000*0.1 + (i-100000)*0.075;
    else if (i <= 400000) bonus = 100000*0.1 + 100000*0.075 + (i-200000)*0.05;
    else if (i <= 600000) bonus = 100000*0.1 + 100000*0.075 + 200000*0.05 + (i-400000)*0.03;
    else if (i <= 1000000) bonus = 100000*0.1 + 100000*0.075 + 200000*0.05 + 200000*0.03 + (i-600000)*0.015;
    else bonus = 100000*0.1 + 100000*0.075 + 200000*0.05 + 200000*0.03 + 400000*0.015 + (i-1000000)*0.01;
    printf("奖金是:%.2f\n", bonus);
}